knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-07/0/epsilon
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}

dimensions      [0 2 -3 0 0 0 0];
internalField   uniform {{EPSILON_INLET}};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform {{EPSILON_INLET}};
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            epsilonWallFunction;
        value           uniform {{EPSILON_INLET}};
    }

    frontAndBack
    {
        type            empty;
    }
}
