knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-07/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform {{K_INLET}};

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform {{K_INLET}};
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform {{K_INLET}};
    }

    frontAndBack
    {
        type            empty;
    }
}
