knowledge_compiler/phase2/execution_layer/templates/openfoam/BENCH-07/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     {{APPLICATION}};

// Phase 7 preset: BENCH-07 backward-facing step benchmark
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         {{END_TIME}};
deltaT          {{DELTA_T}};

writeControl    timeStep;
writeInterval   {{WRITE_INTERVAL}};
purgeWrite      0;
writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;
runTimeModifiable yes;
